# -*- coding:utf-8 -*-
import os

DUMP_DIR = '/home/rhino/s/a'
if not os.path.exists(DUMP_DIR):
    os.makedirs(DUMP_DIR)

# 2001年科技股泡沫破裂&国有股坚持
# 2008年次贷危机：
# 2015年杠杆股灾
# 2018年贸易战&去杠杆
# 2020年疫情
# 2022年地产债务&外资流出
CRASHES = [
    ("2001-06-01", "2005-07-01"),
    ("2007-10-01", "2008-11-01"),
    ("2015-06-01", "2015-10-01"),
    ("2018-01-01", "2019-01-01"),
    ("2020-01-01", "2020-04-01"),
    ("2022-02-01", "2022-12-01"),
]

# 回溯开始时间
START_DATE = "2018-01-01"

# 证券代码
STOCK_CODE = "sh.600309"
STOCK_NAME = "万华化学"

# 目标买入价
BID_PRICE = 55

# 上涨 20% 卖出
SELL_RATE = 1.2